Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 8000, 1)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 20, 32)            288       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 10, 32)            0         
_________________________________________________________________
activation (Activation)      (None, 10, 32)            0         
_________________________________________________________________
flatten (Flatten)            (None, 320)               0         
_________________________________________________________________
dropout (Dropout)            (None, 320)               0         
_________________________________________________________________
dense (Dense)                (None, 50)                16050     
_________________________________________________________________
dense_1 (Dense)              (None, 10)                510       
=================================================================
Total params: 16,848
Trainable params: 16,848
Non-trainable params: 0
_________________________________________________________________
# Fit model on training data
[0,01634638+0,07640878+0,08142161+0,08890935+0,06668034+0,02189251
+0,08374681+0,0920663+ 0,01668154+0,0730464 ]

Sum: 0.61720002
