Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 8000, 1)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 20, 32)            288       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 10, 32)            0         
_________________________________________________________________
activation (Activation)      (None, 10, 32)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 8, 64)             6208      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 4, 64)             0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 64)             0         
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 50)                12850     
_________________________________________________________________
dense_1 (Dense)              (None, 10)                510       
=================================================================
Total params: 19,856
Trainable params: 19,856
Non-trainable params: 0
_________________________________________________________________
# Fit model on training data
[0,01597319+0,07431231+0,07957274+0,07741541+0,06117802+0,01594719
+0,08336022+0,09003564+0,0125491+ 0,07393455]

Sum: 0.58427837