Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 8000, 1)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 20, 32)            288       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 10, 32)            0         
_________________________________________________________________
activation (Activation)      (None, 10, 32)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 8, 64)             6208      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 4, 64)             0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 64)             0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 2, 96)             18528     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 1, 96)             0         
_________________________________________________________________
activation_2 (Activation)    (None, 1, 96)             0         
_________________________________________________________________
flatten (Flatten)            (None, 96)                0         
_________________________________________________________________
dropout (Dropout)            (None, 96)                0         
_________________________________________________________________
dense (Dense)                (None, 50)                4850      
_________________________________________________________________
dense_1 (Dense)              (None, 10)                510       
=================================================================
Total params: 30,384
Trainable params: 30,384
Non-trainable params: 0
_________________________________________________________________
# Fit model on training data
[0.01359389+0.07318581+0.0814337+ 0.06309008+0.06592171+0.01756935
+0.08427461+0.08279548+0.01228777+0.07820325]

Sum: 0.57235565